---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.GenericFatalError
source: html/63e362ee-0d27-d2b7-ebcc-6efb08709ea9.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.GenericFatalError Property

A fatal error has occurred. The application will be terminated. You will be given the opportunity to save
 recovery files for all of your changed projects.\tWould you like to save a recovery file for [Project Name]?

## Syntax (C#)
```csharp
public static FailureDefinitionId GenericFatalError { get; }
```